<?php

namespace App\Http\Controllers\Admin;

use Illuminate\Http\Request;

use App\Http\Requests;
use App\Http\Controllers\Controller;
use App\Form;
use App\Table;
use App\ControlledRow;
use App\ControllingRow;
use App\ControlledColumn;
use App\Medinfo\MIControlTranslater;
use App\Http\Controllers\Admin\CFunctionAdminController;
use App\CFunction;

class MedinfoControlsAdminController extends Controller
{
    //
    public function __construct()
    {
        $this->middleware('auth');
    }

    public function index()
    {
        $forms = Form::orderBy('form_index')->get(['id', 'form_code']);
        return view('jqxadmin.micontrols', compact('forms'));
    }

    public function fetchControlledRows(int $table, int $scope)
    {
        return ControlledRow::ofTable($table)->ofControlScope($scope)->with('table')->with('row')->get();
    }

    public function fetchControllingRows(int $table, int $relation)
    {
        return ControllingRow::ofTable($table)->ofRelation($relation)->with('table')->with('row')->get();
    }

    public function fetchColumns(int $firstcol, int $countcol)
    {
        return ControlledColumn::where('rec_id','>=' ,$firstcol)->where('rec_id', '<', $firstcol + $countcol)->get();
    }

    public function MIRulesTranslate(int $form)
    {

        $tables = Table::OfForm($form)->get();

        foreach ($tables as $table) {
            $rules = new MIControlTranslater($table->id);
            $all_rules = $rules->translateAll();
            //dd($all_rules);
            echo '<pre>';
            echo "// {$table->table_code}  \n";
            foreach ($all_rules['intable'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['inform'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['inreport'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['columns'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['inrow'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            echo '</pre>';

        }
    }

    public function BatchRuleSave()
    {

        $rules = [
// 1000
            ['text' => 'сравнение(С1.0, С2.0+С3.0+С4.0+С5.0+С6.0+С7.0+С8.0+С9.0+С10.0+С11.0+С12.0+С13.0+С14.0+С15.0+С16.0+С17.0+С18.0+С19.0+С20.0, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С2.0, С2.1+С2.2+С2.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С3.0, С3.1+С3.2, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С3.1.1, С3.1, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С4.0, С4.1+С4.2+С4.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С4.1.1, С4.1Г, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С4.2, С4.2.1Г, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С5.0, С5.1+С5.2+С5.3+С5.4+С5.5+С5.6+С5.7+С5.8+С5.9+С5.10+С5.11+С5.12+С5.13+С5.14+С5.15, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С5.1, С5.1.1+С5.1.2+С5.1.3+С5.1.4+С5.1.5+С5.1.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С5.2, С5.2.2, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С5.2.1, С5.2, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С6.0, С6.1+С6.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.0, С7.1+С7.2+С7.3+С7.4+С7.5+С7.6+С7.7+С7.8+С7.9+С7.10+С7.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.1, С7.1.1+С7.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.3, С7.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.5, С7.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.6, С7.6.1+С7.6.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.7, С7.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.8, С7.8.1+С7.8.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С7.9, С7.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С8.0, С8.1+С8.2+С8.3+С8.4+С8.5+С8.6+С8.7+С8.8+С8.9+С8.10+С8.11+С8.12, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С8.2, С8.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С8.10, С8.10.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С8.11, С8.11.1+С8.11.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С8.12, С8.12.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С9.0, С9.1+С9.2+С9.3+С9.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С9.2, С9.2.1+С9.2.2+С9.2.3+С9.2.4+С9.2.5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1,'table_id'=> 111],
            ['text' => 'сравнение(С9.3, С9.3.1+С9.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С9.4, С9.4.1+С9.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С10.0, С10.1+С10.2+С10.3+С10.4+С10.5+С10.6+С10.8, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С10.2, С10.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С10.3, С10.3.1+С10.3.2+С10.3.3+С10.3.4, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111 ],
            ['text' => 'сравнение(С10.5, С10.5.1+С10.5.2+С10.5.3+С10.5.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111],
            ['text' => 'сравнение(С10.6, С10.6.1+С10.6.2+С10.6.3+С10.6.4+С10.6.5+С10.6.6+С10.6.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С10.8, С10.8.1+С10.8.2+С10.8.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С11.0, С11.1+С11.2+С11.3+С11.4+С11.5+С11.6+С11.7+С11.8+С11.9+С11.10+С11.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С11.1, С11.1.1+С11.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С12.0, С12.1+С12.2+С12.3+С12.4+С12.5+С12.6+С12.7+С12.8+С12.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С12.5, С12.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С12.7, С12.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С12.9, С12.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С13.0, С13.1+С13.2+С13.3+С13.4+С13.5+С13.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С13.4, С13.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С14.0, С14.1+С14.2+С14.3+С14.4+С14.5+С14.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С14.1, С14.1.1+С14.1.2+С14.1.3+С14.1.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111],
            ['text' => 'сравнение(С14.2, С14.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С14.4, С14.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С14.6, С14.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С15.0, С15.1+С15.2+С15.3+С15.4+С15.5+С15.7+С15.8+С15.9+С15.10+С15.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С15.8, С15.8.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],
            ['text' => 'сравнение(С18.0, С18.1+С18.2+С18.3+С18.4+С18.5+С18.6+С18.7+С18.8+С18.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 111  ],

            ['text' => 'сравнение(С6.0Г4, Ф11Т1000С01Г6+Ф10Т2000С1Г6, >=, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С6.0Г9, Ф11Т2000С01Г6+Ф10Т3000С1Г6, >=, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С6.1Г4, Ф11Т1000С01Г6, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С6.1Г9, Ф11Т2000С01Г6, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 111  ],

            ['text' => 'сравнение(Г4, Г15, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г5, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г6, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г8, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г9, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г10,+Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г11,+Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г14, Г8+Г5+Г6, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г14+Г15, Г8+Г5+Г6, =, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(Г15, Г8-Г14, =, группы(*), строки(*))', 'comment' => 'разница на выбывших и перешедших в другую группу по возрасту', 'level' => 2 , 'table_id' => 111  ],

            ['text' => 'сравнение(С2.1Г9, С2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С2.2Г9, С2.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С9.2.1Г9, С9.2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.1Г9, С10.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.5.1Г9, С10.5.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.5.2Г9, С10.5.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.5.3Г9, С10.5.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.6.1Г9, С10.6.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.6.2Г9, С10.6.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.6.3Г9, С10.6.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.6.4Г9, С10.6.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.6.5Г9, С10.6.5Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С10.6.7Г9, С10.6.7Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С11.1.1Г9, С11.1.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С11.1.2Г9, С11.1.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С11.2Г4, С11.2Г9, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С11.3Г9, С11.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С11.4Г9, С11.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С12.9.1Г9, С12.9.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С17.0Г9, С17.0Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],
            ['text' => 'сравнение(С20.0Г9, С20.0Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 111  ],

// 1001
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 433  ],
            ['text' => 'сравнение(С1Г3, С3Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 433  ],
            ['text' => 'сравнение(С1Г3, Т1000С1.0Г4, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 433  ],
            ['text' => 'сравнение(С2Г3, Т1000С1.0Г9, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 433  ],
            ['text' => 'сравнение(С3Г3, Т1000С1.0Г15, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 433  ],

// 1002
            ['text' => 'сравнение(С1Г3, Т1000С1.0Г5, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 434  ],
            ['text' => 'сравнение(С2Г3, Т1000С1.0Г6, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 434  ],


// 1100
            ['text' => 'сравнение(С1.0, С1.1+С1.2+С1.3+С1.4+С1.5+С1.6+С1.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id'=> 185],
            ['text' => 'сравнение(С1.1, С1.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 185  ],
            ['text' => 'сравнение(С1.2, С1.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 185  ],
            ['text' => 'сравнение(С1.4, С1.4.1+С1.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 185  ],
            ['text' => 'сравнение(С1.6, С1.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 185  ],
            ['text' => 'сравнение(С1.7Г, +С1.7.1Г+С1.7.2Г, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 185  ],
            ['text' => 'сравнение(Г4, Г5, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 185  ],

// 1500
            ['text' => 'сравнение(С1.0, С2.0+С3.0+С4.0+С5.0+С6.0+С7.0+С8.0+С9.0+С10.0+С11.0+С12.0+С13.0+С14.0+С15.0+С16.0+С17.0+С18.0+С19.0+С20.0, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С2.0, С2.1+С2.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С3.0, С3.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С3.1.1, С3.1, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С4.0, С4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С5.0, С5.1+С5.2+С5.3+С5.6+С5.9+С5.10+С5.14, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С5.1, С5.1.1+С5.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С6.0, С6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С7.0, С7.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С8.0, С8.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С9.0, С9.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(С11.0, С11.1+С11.2+С11.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 966  ],
            ['text' => 'сравнение(Г4, Г15, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(Г4, Г5, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(Г4, Г8, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(Г9, Г10, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(Г9, Г11, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(Г15, Г8-Г14, =, группы(*), строки(*))', 'comment' => 'разница на выбывших и перешедших в другую группу по возрасту', 'level' => 2 , 'table_id' => 966  ],
            ['text' => 'сравнение(Г4, Г9, =, группы(*), строки(*))', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(СГ4, Т1000СГ4, <=, группы(*), строки(*))', 'comment' => 'в т.1000 больше равно т. 1500', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(СГ8, Т1000СГ8, <=, группы(*), строки(*))', 'comment' => 'в т.1000 больше равно т. 1500', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(СГ9, Т1000СГ9, <=, группы(*), строки(*))', 'comment' => 'в т.1000 больше равно т. 1500', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(СГ10, Т1000СГ10, <=, группы(*), строки(*))', 'comment' => 'в т.1000 больше равно т. 1500', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(СГ11, Т1000СГ11, <=, группы(*), строки(*))', 'comment' => 'в т.1000 больше равно т. 1500', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(СГ14, Т1000СГ14, <=, группы(*), строки(*))', 'comment' => 'в т.1000 больше равно т. 1500', 'level' => 1 , 'table_id' => 966  ],
            ['text' => 'сравнение(СГ15, Т1000СГ15, <=, группы(*), строки(*))', 'comment' => 'в т.1000 больше равно т. 1500', 'level' => 1 , 'table_id' => 966  ],

// 1600
            ['text' => 'сравнение(С1.0, С1.1+С1.2+С1.4+С1.5+С1.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id'=> 967],
            ['text' => 'сравнение(С1.4, С1.4.1+С1.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 967],
            ['text' => 'сравнение(С1.7, С1.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 967],
            ['text' => 'сравнение(С1.7.1, С1.7.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 967],
            ['text' => 'сравнение(Г4, Г5, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 967],

// 1650
            ['text' => 'сравнение(С1Г3, Т1600С1.7.1.1Г3, <=, группы(*), графы(*))', 'comment' => 'меньше чем в т. 1600', 'level' => 1 ,'table_id'=> 968],

// 1700
// 1800
// 1900

// 2000
            ['text' => 'сравнение(С1.0, С2.0+С3.0+С4.0+С5.0+С6.0+С7.0+С8.0+С9.0+С10.0+С11.0+С12.0+С13.0+С14.0+С15.0+С16.0+С17.0+С18.0+С19.0+С20.0, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С2.0, С2.1+С2.2+С2.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С3.0, С3.1+С3.2, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С3.1, С3.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С4.0, С4.1+С4.2+С4.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С4.1, С4.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С4.2, С4.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С5.0, С5.1+С5.2+С5.3+С5.4+С5.5+С5.6+С5.7+С5.8+С5.10+С5.11+С5.12+С5.13+С5.14+С5.15, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С5.1, С5.1.1+С5.1.2+С5.1.3+С5.1.4+С5.1.5+С5.1.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С5.2, С5.2.2+С5.2.3, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С5.2.1, С5.2, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С6.0, С6.1+С6.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.0, С7.1+С7.2+С7.3+С7.4+С7.5+С7.6+С7.7+С7.8+С7.9+С7.10+С7.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.1, С7.1.1+С7.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.3, С7.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.5, С7.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.6, С7.6.1+С7.6.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.7, С7.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.8, С7.8.1+С7.8.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С7.9, С7.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С8.0, С8.1+С8.2+С8.3+С8.4+С8.5+С8.6+С8.7+С8.8+С8.9+С8.10+С8.11+С8.12, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С8.2, С8.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С8.10, С8.10.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С8.11, С8.11.1+С8.11.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С8.12, С8.12.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С9.0, С9.1+С9.2+С9.3+С9.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С9.2, С9.2.1+С9.2.2+С9.2.3+С9.2.4+С9.2.5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1,'table_id' =>112],
            ['text' => 'сравнение(С9.3, С9.3.1+С9.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С9.4, С9.4.1+С9.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.0, С10.1+С10.2+С10.3+С10.4+С10.5+С10.6+С10.7+С10.8, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.2, С10.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.3, С10.3.1+С10.3.2+С10.3.3+С10.3.4, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112],
            ['text' => 'сравнение(С10.4, С10.4.1+С10.4.2+С10.4.3+С10.4.4+С10.4.5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.1, С10.4.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.5, С10.4.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.5, С10.5.1+С10.5.2+С10.5.3+С10.5.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112],
            ['text' => 'сравнение(С10.6, С10.6.1+С10.6.2+С10.6.3+С10.6.4+С10.6.5+С10.6.6+С10.6.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.6, С10.6.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С10.8, С10.8.1+С10.8.2+С10.8.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С11.0, С11.1+С11.2+С11.3+С11.4+С11.5+С11.6+С11.7+С11.8+С11.9+С11.10+С11.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С11.1, +С11.1.1+С11.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С12.0, +С12.1+С12.2+С12.3+С12.4+С12.5+С12.6+С12.7+С12.8+С12.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С12.5, С12.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С12.7, С12.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С12.9, С12.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С13.0, С13.1+С13.2+С13.3+С13.4+С13.5+С13.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С13.4, С13.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С14.0, С14.1+С14.2+С14.3+С14.4+С14.5+С14.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С14.1, С14.1.1+С14.1.2+С14.1.3+С14.1.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112],

            ['text' => 'сравнение(С14.2, С14.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С14.4, С14.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С14.6, С14.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С15.0, С15.1+С15.2+С15.3+С15.4+С15.5+С15.7+С15.8+С15.9+С15.10+С15.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С15.8, С15.8.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],
            ['text' => 'сравнение(С18.0, С18.1+С18.2+С18.3+С18.4+С18.5+С18.6+С18.7+С18.8+С18.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 112  ],

            ['text' => 'сравнение(С6.0Г4, Ф11Т1000С01Г7+Ф10Т2000С1Г7, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С6.0Г9, Ф11Т2000С01Г7+Ф10Т3000С1Г7, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С6.1Г4, Ф11Т1000С01Г7, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С6.1Г9, Ф11Т2000С01Г7, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 112  ],

            ['text' => 'сравнение(Г4, Г7+Г9-Г13, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(Г7, Г16, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(Г8, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(Г9, Г13, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(Г10, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(Г11, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(Г12, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(Г13, Г7, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],

            ['text' => 'сравнение(Г15, Г8-Г14, =, группы(*), строки(*))', 'comment' => 'разница на выбывших и перешедших в другую группу по возрасту', 'level' => 2 , 'table_id' => 112  ],

            ['text' => 'сравнение(Г16, Г7+Г15-Г4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С2.1Г9, С2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С2.1Г13, С2.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С2.2Г9, С2.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С2.2Г13, С2.2Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],


            ['text' => 'сравнение(С4.2.1Г4, С4.2.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С4.2.1Г13, С4.2.1Г9, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С4.2.1Г16, С4.2.1Г15, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С5.6Г4, С5.6Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С5.6Г13, С5.6Г9, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С5.6Г16, С5.6Г15, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С5.8Г4, С5.8Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С5.8Г13, С5.8Г9, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С5.8Г16, С5.8Г15, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],

            ['text' => 'сравнение(С9.2.1Г9, С9.2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С9.2.1Г13, С9.2.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.1Г9, С10.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.1Г13, С10.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.1.1Г9, С10.4.1.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.1.1Г13, С10.4.1.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.2Г9, С10.4.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.2Г13, С10.4.2Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.3Г9, С10.4.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.3Г13, С10.4.3Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.4Г9, С10.4.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.4.4Г13, С10.4.4Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.5.1Г9, С10.5.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.5.1Г13, С10.5.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.5.2Г9, С10.5.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],

            ['text' => 'сравнение(С10.5.2Г13, С10.5.2Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.5.3Г9, С10.5.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.5.3Г13, С10.5.3Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.1Г9, С10.6.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.1Г13, С10.6.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.2Г9, С10.6.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],

            ['text' => 'сравнение(С10.6.2Г13, С10.6.2Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.3Г9, С10.6.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.3Г13, С10.6.3Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.4Г9, С10.6.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.4Г13, С10.6.4Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.5Г9, С10.6.5Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.5Г13, С10.6.5Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.7Г9, С10.6.7Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С10.6.7Г13, С10.6.7Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.1.1Г9, С11.1.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.1.1Г13, С11.1.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.1.2Г9, С11.1.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.1.2Г13, С11.1.2Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.2Г9, С11.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.2Г13, С11.2Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.3Г4, С11.3Г9, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.3Г7, С11.3Г13, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.4Г9, С11.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С11.4Г13, С11.4Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С12.9.1Г9, С12.9.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С12.9.1Г13, С12.9.1Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С15.5Г4, С15.5Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С15.5Г9, С15.5Г13, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С15.5Г16, С15.5Г15, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],

            ['text' => 'сравнение(С20.0Г4, +С20.0Г15, >=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г7, +С20.0Г4, <=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г8, +С20.0Г4, <=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г9, +С20.0Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г10, +С20.0Г9, <=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г11, +С20.0Г9, <=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г12, +С20.0Г9, <=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г13, +С20.0Г7, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г14, +С20.0Г8, <=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г15, +С20.0Г8-С20.0Г14, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],
            ['text' => 'сравнение(С20.0Г16, +С20.0Г15, <=, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 112  ],

// 2001
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 435  ],
            ['text' => 'сравнение(С3Г3, С1Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 435  ],
            ['text' => 'сравнение(С1Г3, Т2000С1.0Г4, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 435  ],
            ['text' => 'сравнение(С2Г3, Т2000С1.0Г9, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 435  ],
            ['text' => 'сравнение(С3Г3, Т2000С1.0Г15, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 435  ],

// 2100
            ['text' => 'сравнение(С1.0, С1.1+С1.2+С1.3+С1.4+С1.5+С1.6+С1.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' =>186],
            ['text' => 'сравнение(С1.1, С1.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 186  ],
            ['text' => 'сравнение(С1.2, С1.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 186  ],
            ['text' => 'сравнение(С1.4, С1.4.1+С1.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 186  ],
            ['text' => 'сравнение(С1.6, С1.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 186  ],
            ['text' => 'сравнение(С1.7, С1.7.1+С1.7.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 186  ],
            ['text' => 'сравнение(Г4, Г5, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 186  ],

// 3000
            ['text' => 'сравнение(С1.0, С2.0+С3.0+С4.0+С5.0+С6.0+С7.0+С8.0+С9.0+С10.0+С11.0+С12.0+С13.0+С14.0+С15.0+С16.0+С17.0+С18.0+С19.0+С20.0, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С2.0, С2.1+С2.2+С2.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С3.0, С3.1+С3.2, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С3.1, С3.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С4.0, С4.1+С4.2+С4.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С4.1, С4.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С4.2, С4.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С5.0, С5.1+С5.2+С5.3+С5.4+С5.5+С5.6+С5.7+С5.8+С5.10+С5.11+С5.12+С5.13+С5.14+С5.15, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С5.1, С5.1.1+С5.1.2+С5.1.3+С5.1.4+С5.1.5+С5.1.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С5.2, С5.2.2+С5.2.3, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С5.2.1, С5.2, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С6.0, С6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.0, С7.1+С7.2+С7.3+С7.4+С7.5+С7.6+С7.7+С7.8+С7.9+С7.10+С7.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.1, С7.1.1+С7.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.3, С7.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.5, С7.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.6, С7.6.1+С7.6.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.7, С7.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.8, С7.8.1+С7.8.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С7.9, С7.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С8.0, С8.1+С8.2+С8.3+С8.4+С8.5+С8.6+С8.7+С8.8+С8.9+С8.10+С8.11+С8.12, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С8.2.1, С8.2Г, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С8.10, С8.10.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С8.11, С8.11.1+С8.11.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С8.12, С8.12.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С9.0, С9.1+С9.2+С9.3+С9.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С9.2, С9.2.1+С9.2.2+С9.2.3+С9.2.4+С9.2.5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк','level' => 1,'table_id' => 113],
            ['text' => 'сравнение(С9.3, С9.3.1+С9.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С9.4, С9.4.1+С9.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С10.0, С10.1+С10.2+С10.3+С10.4+С10.5+С10.6+С10.7+С10.8, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С10.2, С10.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С10.3, С10.3.1+С10.3.2+С10.3.3+С10.3.4, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113],
            ['text' => 'сравнение(С10.4, С10.4.1+С10.4.2+С10.4.3+С10.4.4+С10.4.5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С10.4.1, С10.4.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С10.4.5, С10.4.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С10.5, С10.5.1+С10.5.2+С10.5.3+С10.5.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113],
            ['text' => 'сравнение(С10.6, С10.6.1+С10.6.2+С10.6.3+С10.6.4+С10.6.5+С10.6.6+С10.6.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С10.8, С10.8.1+С10.8.2+С10.8.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С11.0, С11.1+С11.2+С11.3+С11.4+С11.5+С11.6+С11.7+С11.8+С11.9+С11.10+С11.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С11.1, С11.1.1+С11.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С12.0, С12.1+С12.2+С12.3+С12.4+С12.5+С12.6+С12.7+С12.8+С12.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С12.5, С12.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С12.7, С12.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С12.9, С12.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С13.0, С13.1+С13.2+С13.3+С13.4+С13.5+С13.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С13.4, С13.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С14.0, С14.1+С14.2+С14.3+С14.4+С14.5+С14.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С14.1, С14.1.1+С14.1.2+С14.1.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С14.2, С14.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С14.4, С14.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С14.6, С14.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С15.0, С15.1+С15.2+С15.3+С15.4+С15.5+С15.6+С15.7+С15.8+С15.9+С15.10+С15.11+С15.12, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С15.8, С15.8.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],
            ['text' => 'сравнение(С18.0, С18.1+С18.2+С18.3+С18.4+С18.5+С18.6+С18.7+С18.8+С18.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 113  ],


            ['text' => 'сравнение(С6.0Г4, Ф11Т1000С01Г8+Ф11Т1000С01Г9+Ф11Т1000С01Г10+Ф11Т1000С01Г11+Ф10Т2000С1Г8+Ф10Т2000С1Г9+Ф10Т2000С1Г10+Ф10Т2000С1Г11, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 113  ],

            ['text' => 'сравнение(С6.0Г9, Ф11Т2000С01Г8+Ф11Т2000С01Г9+Ф11Т2000С01Г10+Ф11Т2000С01Г11+Ф10Т3000С1Г8+Ф10Т3000С1Г9+Ф10Т3000С1Г10+Ф10Т3000С1Г11, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 113  ],

            ['text' => 'сравнение(С6.1Г4, Ф11Т1000С01Г8+Ф11Т1000С01Г9+Ф11Т1000С01Г10+Ф11Т1000С01Г11, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 113  ],

            ['text' => 'сравнение(С6.1Г9, Ф11Т2000С01Г8+Ф11Т2000С01Г9+Ф11Т2000С01Г10+Ф11Т2000С01Г11, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 113  ],

//['text' => 'сравнение(С20.0Г4, +Ф57Т4444С1Г16+Ф57Т4444С2Г16, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 113  ],

            ['text' => 'сравнение(Г4, Г15, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(Г8, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(Г9, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(Г10, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(Г11, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(Г12, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(Г14, Г8, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(Г15, Г8-Г14, =, группы(*), строки(*))', 'comment' => 'разница на выбывших и перешедших в другую группу по возрасту', 'level' => 2 , 'table_id' => 113  ],


            ['text' => 'сравнение(С2.1Г9, С2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С2.2Г9, С2.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С9.2.1Г9, С9.2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.1Г9, С10.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.4.1.1Г9, С10.4.1.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.4.2Г9, С10.4.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.4.3Г9, С10.4.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.4.4Г9, С10.4.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.5.1Г9, С10.5.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.5.2Г9, С10.5.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.5.3Г9, С10.5.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.6.1Г9, С10.6.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.6.2Г9, С10.6.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.6.3Г9, С10.6.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.6.4Г9, С10.6.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.6.5Г9, С10.6.5Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С10.6.7Г9, С10.6.7Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С11.1.1Г9, С11.1.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С11.1.2Г9, С11.1.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С11.2Г9, С11.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С11.3Г9, С11.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С11.4Г9, С11.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С12.9.1Г9, С12.9.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С17.0Г9, С17.0Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],
            ['text' => 'сравнение(С20.0Г9, С20.0Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 113  ],

// 3002
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 439  ],
            ['text' => 'сравнение(С3Г3, С1Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 439  ],
            ['text' => 'сравнение(С1Г3, Т3000С1.0Г4, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 439  ],
            ['text' => 'сравнение(С2Г3, Т3000С1.0Г9, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 439  ],
            ['text' => 'сравнение(С3Г3, Т3000С1.0Г15, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 439  ],

// 3100
            ['text' => 'сравнение(С1.0, С1.1+С1.2+С1.3+С1.4+С1.5+С1.6+С1.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' =>705],
            ['text' => 'сравнение(С1.1, С1.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 705  ],
            ['text' => 'сравнение(С1.2, С1.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 705  ],
            ['text' => 'сравнение(С1.4, С1.4.1+С1.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 705  ],
            ['text' => 'сравнение(С1.6, С1.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 705  ],
            ['text' => 'сравнение(С1.7, С1.7.1+С1.7.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 705  ],

            ['text' => 'сравнение(СГ4, Т4100СГ4, >=, группы(*), строки(*))', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 705  ],
            ['text' => 'сравнение(СГ5, Т4100СГ5, >=, группы(*), строки(*))', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 705  ],
            ['text' => 'сравнение(Г4, Г5, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 705  ],

// 4000
            ['text' => 'сравнение(С1.0, С2.0+С3.0+С4.0+С5.0+С6.0+С7.0+С8.0+С9.0+С10.0+С11.0+С12.0+С13.0+С14.0+С15.0+С16.0+С18.0+С19.0+С20.0, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С2.0, С2.1+С2.2+С2.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С3.0, С3.1+С3.2, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С3.1, С3.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С4.0, С4.1+С4.2+С4.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С4.1, С4.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С4.2, С4.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С5.0, С5.1+С5.2+С5.3+С5.4+С5.5+С5.6+С5.7+С5.8+С5.10+С5.11+С5.12+С5.13+С5.14+С5.15, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С5.1, С5.1.1+С5.1.2+С5.1.3+С5.1.4+С5.1.5+С5.1.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С5.2, С5.2.2+С5.2.3, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С5.2.1, С5.2, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С6.0, С6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],


            ['text' => 'сравнение(С7.0, С7.1+С7.2+С7.3+С7.4+С7.5+С7.6+С7.7+С7.8+С7.9+С7.10+С7.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С7.1, С7.1.1+С7.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С7.3, С7.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С7.5, С7.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С7.6, С7.6.1+С7.6.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С7.7, С7.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С7.8, +С7.8.1+С7.8.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С7.9, С7.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С8.0, С8.1+С8.2+С8.3+С8.4+С8.6+С8.5+С8.7+С8.8+С8.9+С8.10+С8.11+С8.12, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С8.2.1, С8.2, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С8.10, С8.10.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С8.11, С8.11.1+С8.11.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С8.12, С8.12.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С9.0, С9.1+С9.2+С9.3+С9.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С9.2, С9.2.1+С9.2.2+С9.2.3+С9.2.4+С9.2.5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1,'table_id' =>441],
            ['text' => 'сравнение(С9.3, С9.3.1+С9.3.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С9.4, С9.4.1+С9.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.0, С10.1+С10.2+С10.3+С10.4+С10.5+С10.6+С10.7+С10.8, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.2, С10.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],

            ['text' => 'сравнение(С10.3, С10.3.1+С10.3.2+С10.3.3+С10.3.4, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.4, С10.4.1+С10.4.2+С10.4.3+С10.4.4+С10.4.5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.4.1, С10.4.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.4.5, С10.4.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.5, С10.5.1+С10.5.2+С10.5.3+С10.5.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.6, С10.6.1+С10.6.2+С10.6.3+С10.6.4+С10.6.5+С10.6.6+С10.6.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С10.8, С10.8.1+С10.8.2+С10.8.3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С11.0, С11.1+С11.2+С11.3+С11.4+С11.5+С11.6+С11.7+С11.8+С11.9+С11.10+С11.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],

            ['text' => 'сравнение(С11.1, С11.1.1+С11.1.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],

            ['text' => 'сравнение(С12.0, С12.1+С12.2+С12.3+С12.4+С12.5+С12.6+С12.7+С12.8+С12.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С12.5, С12.5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С12.7, С12.7.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С12.9, С12.9.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С13.0, С13.1+С13.2+С13.3+С13.4+С13.5+С13.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С13.4, С13.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С14.0, С14.1+С14.2+С14.3+С14.4+С14.5+С14.6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С14.1, С14.1.1+С14.1.2+С14.1.4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С14.2, С14.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С14.4, С14.4.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С14.6, С14.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С15.0, С15.1+С15.2+С15.3+С15.4+С15.5+С15.7+С15.8+С15.9+С15.10+С15.11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С15.8, С15.8.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(С18.0, С18.1+С18.2+С18.3+С18.4+С18.5+С18.6+С18.7+С18.8+С18.9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 441  ],
            ['text' => 'сравнение(Г4, Г15, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(Г8, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(Г9, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(Г10, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(Г11, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(Г12, Г9, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 441  ],

            ['text' => 'сравнение(Г15, Г8-Г14, =, группы(*), строки(*))', 'comment' => 'разница на выбывших и перешедших в другую группу возрасту', 'level' => 2 , 'table_id' => 441  ],


            ['text' => 'сравнение(С2.1Г9, С2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С2.2Г9, С2.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С9.2.1Г9, С9.2.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.1Г9, С10.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.4.1.1Г9, С10.4.1.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.4.2Г9, С10.4.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.4.3Г9, С10.4.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.4.4Г9, С10.4.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.5.1Г9, С10.5.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.5.2Г9, С10.5.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.5.3Г9, С10.5.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.6.1Г9, С10.6.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.6.2Г9, С10.6.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.6.3Г9, С10.6.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.6.4Г9, С10.6.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.6.5Г9, С10.6.5Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С10.6.7Г9, С10.6.7Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С11.1.1Г9, С11.1.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С11.1.2Г9, С11.1.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С11.2Г9, С11.2Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С11.3Г9, С11.3Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С11.4Г9, С11.4Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С12.9.1Г9, С12.9.1Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(С20.0Г9, С20.0Г4, =, группы(*), строки())', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => 441  ],

            ['text' => 'сравнение(СГ4, Т3000СГ4, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(СГ8, Т3000СГ8, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(СГ9, Т3000СГ9, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(СГ10, Т3000СГ10, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(СГ11, Т3000СГ11, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(СГ12, Т3000СГ12, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(СГ14, Т3000СГ14, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],
            ['text' => 'сравнение(СГ15, Т3000СГ15, <=, группы(*), строки(*))', 'comment' => 'в т.3000 больше равно т. 4000', 'level' => 1 , 'table_id' => 441  ],


// 4001
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 457  ],
            ['text' => 'сравнение(С3Г3, С1Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 457  ],
            ['text' => 'сравнение(С1Г3, Т4000С1.0Г4, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 457  ],
            ['text' => 'сравнение(С2Г3, Т4000С1.0Г9, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 457  ],
            ['text' => 'сравнение(С3Г3, Т4000С1.0Г15, <=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 457  ],

// 4100
            ['text' => 'сравнение(С1.0, С1.1+С1.2+С1.3+С1.4+С1.5+С1.6+С1.7, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк','level' => 1 ,'table_id' => 479],
            ['text' => 'сравнение(С1.1, С1.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 479  ],
            ['text' => 'сравнение(С1.2, С1.2.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 479  ],
            ['text' => 'сравнение(С1.4, С1.4.1+С1.4.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 479  ],
            ['text' => 'сравнение(С1.6, С1.6.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 479  ],
            ['text' => 'сравнение(С1.7, С1.7.1+С1.7.2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 479  ],
            ['text' => 'сравнение(СГ4, Т3100СГ4, <=, группы(*), строки(*))', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 479  ],
            ['text' => 'сравнение(СГ5, Т3100СГ5, <=, группы(*), строки(*))', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 479  ],
            ['text' => 'сравнение(Г4, Г5, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 479  ],

// 5000
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 521  ],
            ['text' => 'сравнение(С3Г3, С4Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 521  ],

// 5100
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 660  ],

        ];
        $table = Table::find($rules[0]['table_id']);
        $dcheck = new CFunctionAdminController();
        echo '<pre>';
        foreach ($rules as $rule) {
            $cache = $dcheck->compile($rule['text'], $table);
            if (!$cache) {
                echo "<span style='color: red'>Правило: " . $rule['text'] . " не сохранено. " . $dcheck->compile_error . "</span>\n";
            } else {
                $rule['function'] = $dcheck->functionIndex;
                $this->saveScript($rule, $cache);
                echo "<span style='color: green'>Правило: " . $rule['text'] . " сохранено</span>\n";
            }
        }
        echo '</pre>';
    }

    public function saveScript($rule, $cache)
    {
        $newfunction = new CFunction();
        $newfunction->table_id = $rule['table_id'];
        $newfunction->level = $rule['level'];
        $newfunction->function = $rule['function'];
        $newfunction->script = $rule['text'];
        $newfunction->comment = $rule['comment'];
        $newfunction->blocked = 0;
        $newfunction->compiled_cashe = $cache;
        return $newfunction->save();
    }

}
