<?php

namespace App\Http\Controllers\Admin;

use Illuminate\Http\Request;

use App\Http\Requests;
use App\Http\Controllers\Controller;
use App\Form;
use App\Table;
use App\ControlledRow;
use App\ControllingRow;
use App\ControlledColumn;
use App\Medinfo\MIControlTranslater;
use App\Http\Controllers\Admin\CFunctionAdminController;
use App\CFunction;

class MedinfoControlsAdminController extends Controller
{
    //
    public function __construct()
    {
        $this->middleware('auth');
    }

    public function index()
    {
        $forms = Form::orderBy('form_index')->get(['id', 'form_code']);
        return view('jqxadmin.micontrols', compact('forms'));
    }

    public function fetchControlledRows(int $table, int $scope)
    {
        return ControlledRow::ofTable($table)->ofControlScope($scope)->with('table')->with('row')->get();
    }

    public function fetchControllingRows(int $table, int $relation)
    {
        return ControllingRow::ofTable($table)->ofRelation($relation)->with('table')->with('row')->get();
    }

    public function fetchColumns(int $firstcol, int $countcol)
    {
        return ControlledColumn::where('rec_id','>=' ,$firstcol)->where('rec_id', '<', $firstcol + $countcol)->get();
    }

    public function MIRulesTranslate(int $form)
    {

        $tables = Table::OfForm($form)->get();

        foreach ($tables as $table) {
            $rules = new MIControlTranslater($table->id);
            $all_rules = $rules->translateAll();
            //dd($all_rules);
            echo '<pre>';
            echo "// {$table->table_code}  \n";
            foreach ($all_rules['intable'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['inform'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['inreport'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['columns'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            foreach ($all_rules['inrow'] as $rule) {
                echo "['text' => '$rule', 'comment' => 'контроль внутри строки', 'level' => 1 , 'table_id' => $table->id  ],\n";
            }
            echo '</pre>';

        }


    }

    public function BatchRuleSave()
    {

        $rules = [

// 2120
            ['text' => 'сравнение(С3, С1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 616  ],
            ['text' => 'сравнение(С1, С2, >, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 616  ],
            ['text' => 'сравнение(С3, С5, >, группы(*), графы(3-8))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 616  ],
            ['text' => 'сравнение(С3, С4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 616  ],
            ['text' => 'сравнение(С5, С6, >, группы(*), графы(3-8))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 616  ],
            ['text' => 'сравнение(С5, С6+С8+С9, >, группы(*), графы(3-8))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 616  ],
            ['text' => 'сравнение(С6, С7, >=, группы(*), графы(3-8))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 616  ],
            ['text' => 'зависимость(С1Г3, Т1001С70Г4, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 616  ],
            ['text' => 'сравнение(С3Г3, Т2200С1Г4+Т2200С3Г4+Т2200С4Г4+Т2200С5Г4+Т2200С6Г4, =, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 616  ],
            ['text' => 'сравнение(Г3, Г4+Г5+Г6+Г7, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 616  ],
            ['text' => 'сравнение(Г3, Г9, >, группы(*), строки(1-4))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 616  ],
            ['text' => 'сравнение(Г7, Г8, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 616  ],

// 2121
            ['text' => 'сравнение(С1Г3, С3Г3+С4Г3, =, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 617  ],
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 617  ],
            ['text' => 'сравнение(С4Г3, С5Г3+С6Г3, >, группы(*), графы(3))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 617  ],
            ['text' => 'сравнение(С1Г3, Т2120С3Г3, =, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 617  ],

// 2200
            ['text' => 'сравнение(С1, С2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 618  ],
            ['text' => 'сравнение(С6, сумма(С7:С15), =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 618  ],
            ['text' => 'сравнение(С1Г4, Т2201С1Г3, >, группы(*), графы(*))', 'comment' => 'должно быть больше чем в т.2201', 'level' => 1 ,'table_id' => 618  ],
            ['text' => 'зависимость(Г4, Г3, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 618  ],

// 2201
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 619  ],


// 2202
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 620  ],

// 2300
            ['text' => 'сравнение(сумма(С1Г3:С4Г4), Т2120С1Г3, =, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 621  ],
            ['text' => 'сравнение(сумма(С1Г5:С4Г6), Т2120С1Г3, =, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 621  ],
            ['text' => 'сравнение(сумма(С1Г3:С4Г3), сумма(С1Г5:С4Г5), =, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 621  ],
            ['text' => 'сравнение(сумма(С1Г4:С4Г4), сумма(С1Г6:С4Г6), =, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 621  ],
            ['text' => 'сравнение(сумма(С1Г3:С4Г4), сумма(С1Г5:С4Г6), =, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 621  ],



// 2350
            ['text' => 'сравнение(С1, С2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 622  ],
            ['text' => 'сравнение(С1, С3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 622  ],
            ['text' => 'сравнение(С4, С5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 622  ],
            ['text' => 'сравнение(С4, С6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 622  ],
            ['text' => 'сравнение(С10, С11+С12, >=, группы(*), графы(3))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 622  ],
            ['text' => 'сравнение(С9Г3, сумма(Т2300С1Г4:Т2300С4Г4), =, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 622  ],
            ['text' => 'сравнение(С9Г3, сумма(Т2300С1Г6:Т2300С4Г6), =, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 622  ],
            ['text' => 'сравнение(Г3, Г4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 622  ],


// 2400
            ['text' => 'сравнение(С1Г3, С5Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 18  ],
            ['text' => 'сравнение(С2Г3, С1Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 18  ],
            ['text' => 'сравнение(С3Г3, С7Г3+С9Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 18  ],
            ['text' => 'сравнение(С5Г3, С6Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 18  ],
            ['text' => 'сравнение(С7Г3, С8Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 18  ],

// 2401
            ['text' => 'сравнение(С1Г3, С3Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 25  ],

// 2402
            ['text' => 'сравнение(С1, С2+С4+С5, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 337  ],
            ['text' => 'сравнение(С2, С3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 337  ],
            ['text' => 'сравнение(С4, С6+С7, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 337  ],
            ['text' => 'сравнение(Г3, Г4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 337  ],

// 2510
            ['text' => 'сравнение(С1, С2, >, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 20  ],
            ['text' => 'сравнение(С3, С4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 20  ],
            ['text' => 'сравнение(С5, С5.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 20  ],
            ['text' => 'сравнение(С5.1, С5.1.1, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 20  ],
            ['text' => 'сравнение(С6, С1+С3+С5, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 20  ],
            ['text' => 'сравнение(С1Г5, Ф31Т2500С02Г3, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 20  ],
            ['text' => 'сравнение(Г3, Г5, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 20  ],
            ['text' => 'сравнение(Г3, Г4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 20  ],
            ['text' => 'сравнение(Г4, Г6, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 20  ],
            ['text' => 'сравнение(Г5, Г7+Г8+Г9+Г12+Г13, =, группы(*), строки(1-4,6))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 20  ],
            ['text' => 'сравнение(Г5, Г7+Г8+Г9, =, группы(*), строки(5,5.1,5.1.1))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 20  ],
            ['text' => 'сравнение(Г5, Г6, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 20  ],
            ['text' => 'сравнение(Г9, Г10+Г11, =, группы(*), строки(5-6))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 20  ],

// 2511
            ['text' => 'сравнение(С1.1Г3, С1Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],
            ['text' => 'сравнение(С2.1Г3, С2Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],
            ['text' => 'сравнение(С3Г3, С4Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],
            ['text' => 'сравнение(С3.1Г3, С3Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],
            ['text' => 'сравнение(С4.1Г3, С4Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],
            ['text' => 'сравнение(С5Г3, С6Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],
            ['text' => 'сравнение(С5.1Г3, С5Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],
            ['text' => 'сравнение(С6.1Г3, С6Г3, <=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 21  ],

// 2512
            ['text' => 'сравнение(С1, С2+С3+С4, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С1, С1.1+С1.2, >, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С1.1, С3, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С2, С1, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С2.1, С2, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С3.1, С3, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С4, С1, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С4.1Г, +С4Г, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(С4.2, С4, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 22  ],
            ['text' => 'сравнение(Г3, СГ4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 22  ],

// 2514
            ['text' => 'сравнение(С1, С4+С5+С6, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 181  ],
            ['text' => 'сравнение(С1, С2+С3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 181  ],
            ['text' => 'сравнение(С7, С1, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 181  ],
            ['text' => 'сравнение(С8, С1, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 181  ],
            ['text' => 'сравнение(Г5, Г3, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 181  ],
            ['text' => 'сравнение(Г6, Г4, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 181  ],

// 2515
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 600  ],
            ['text' => 'сравнение(С2Г3, С3Г3+С4Г3, =, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 600  ],
            ['text' => 'сравнение(С1Г3, Ф37Т2500С04Г4+ Ф37Т2500С04Г5+Ф37Т2500С04Г6+Ф37Т2500С04Г7, =, группы(*), графы())', 'comment' => 'контроль с 37 формой', 'level' => 1 ,'table_id' => 600  ],
            ['text' => 'сравнение(С2Г3, Ф37Т2500С04Г4+ Ф37Т2500С04Г5+Ф37Т2500С04Г6, =, группы(*), графы())', 'comment' => ' контроль с 37 формой ', 'level' => 1 ,'table_id' => 600],
            ['text' => 'сравнение(С3Г3, Ф37Т2500С04Г4, =, группы(*), графы())', 'comment' => ' контроль с 37 формой', 'level' => 1 ,'table_id' => 600  ],
            ['text' => 'сравнение(С4Г3, Ф37Т2500С04Г5, =, группы(*), графы())', 'comment' => ' контроль с 37 формой', 'level' => 1 ,'table_id' => 600  ],

// 2600
            ['text' => 'сравнение(С1+С2, С3+С6, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 24  ],

            ['text' => 'сравнение(С3, С4+С5, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'сравнение(С6, С7+С8+С9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'сравнение(С10, С6, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'сравнение(С11, С10, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'сравнение(С12, С11, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'сравнение(С13, С10, <=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'межгодовой(С1Г3, С6Г3, 0)', 'comment' => 'межгодовой контроль', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'межгодовой(С1Г4, С6Г4, 0)', 'comment' => 'межгодовой контроль', 'level' => 1 ,'table_id' => 24  ],
            ['text' => 'межгодовой(С1Г5, С6Г5, 0)', 'comment' => 'межгодовой контроль', 'level' => 1 ,'table_id' => 24  ],


// 2610
            ['text' => 'сравнение(С1Г3, С5Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 6  ],
            ['text' => 'сравнение(С1Г3+С2Г3, С4Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 6  ],
            ['text' => 'сравнение(С2Г3, С3Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 6  ],
            ['text' => 'сравнение(С4Г3, С5Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 6  ],
            ['text' => 'сравнение(С1Г3, Ф19Т1000С09Г4+Ф19Т1000С10Г4, =, группы(*), графы())', 'comment' => 'межформенный контроль строк', 'level' => 1 , 'table_id' => 6  ],

// 2700
            ['text' => 'сравнение(С1, С2+С3, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 26  ],
            ['text' => 'сравнение(С1, С6, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 26  ],
            ['text' => 'сравнение(С1, С7, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 26  ],
            ['text' => 'зависимость(С2Г3, Т1100С148Г4, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'зависимость(С3Г3, Т1100С145Г4, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'зависимость(С3Г3, Т2704С1Г3, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'зависимость(Г3, Г16, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'сравнение(Г3, Г4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
//['text' => 'сравнение(СГ5, +СГ3, <=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'сравнение(Г6, Г7, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'сравнение(Г6, Г8, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'сравнение(Г9, Г10, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'сравнение(Г11, Г14, >, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'сравнение(Г12, Г13, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],
            ['text' => 'сравнение(Г13, Г14, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 26  ],

// 2701
            ['text' => 'сравнение(С1Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 27  ],
            ['text' => 'сравнение(С3Г3, С1Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 27  ],
            ['text' => 'сравнение(С3Г3, С2Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 27  ],


// 2702
            ['text' => 'сравнение(С1Г3, С2Г3+С3Г3, >=, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 28  ],
            ['text' => 'зависимость(С1Г3, Т1001С53Г3, группы(*), графы())', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 28  ],


// 2704

// 2800
            ['text' => 'сравнение(С1, С2+С6+С8+С9+С12+сумма(С15:С20), =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 29  ],
            ['text' => 'сравнение(С2, С4Г+С5, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 29  ],
            ['text' => 'сравнение(С2, С3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 29  ],
            ['text' => 'сравнение(С6, С7, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 29  ],
            ['text' => 'сравнение(С9, С10+С11, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 29  ],
            ['text' => 'сравнение(С12, С13+С14, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 29  ],
//['text' => 'сравнение(С20, С20.1+С20.2, =, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 29  ],
            ['text' => 'сравнение(С01Г3, Т2801С1Г3, >=, группы(*), графы())', 'comment' => 'внутриформенный контроль строк', 'level' => 1 , 'table_id' => 29  ],
            ['text' => 'сравнение(Г3, Г5+Г6, =, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 29  ],
            ['text' => 'сравнение(Г3, Г4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 29  ],
            ['text' => 'сравнение(Г3, Г7, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 29  ],

// 2801
            ['text' => 'сравнение(С1, С2, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 30  ],
            ['text' => 'сравнение(С1, С9, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 30  ],
            ['text' => 'сравнение(сумма(С5:С8), Т2800С1Г3 , >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 30  ],
            ['text' => 'сравнение(С1, С3, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 30  ],
            ['text' => 'сравнение(С3, С4, >=, группы(*), графы(*))', 'comment' => 'внутритабличный контроль строк', 'level' => 1 ,'table_id' => 30  ],
            ['text' => 'сравнение(Г3, Г4, >=, группы(*), строки(*))', 'comment' => 'контроль граф', 'level' => 1 , 'table_id' => 30  ],



        ];
        $table = Table::find($rules[0]['table_id']);
        $dcheck = new CFunctionAdminController();
        echo '<pre>';
        foreach ($rules as $rule) {
            $cache = $dcheck->compile($rule['text'], $table);
            if (!$cache) {
                echo "<span style='color: red'>Правило: " . $rule['text'] . " не сохранено. " . $dcheck->compile_error . "</span>\n";
            } else {
                $rule['function'] = $dcheck->functionIndex;
                $this->saveScript($rule, $cache);
                echo "<span style='color: green'>Правило: " . $rule['text'] . " сохранено</span>\n";
            }
        }
        echo '</pre>';
    }

    public function saveScript($rule, $cache)
    {
        $newfunction = new CFunction();
        $newfunction->table_id = $rule['table_id'];
        $newfunction->level = $rule['level'];
        $newfunction->function = $rule['function'];
        $newfunction->script = $rule['text'];
        $newfunction->comment = $rule['comment'];
        $newfunction->blocked = 0;
        $newfunction->compiled_cashe = $cache;
        return $newfunction->save();
    }

}
